{
  "data": [
    {
      "name": "Full Stack Developer",
      "value": "We are looking for a highly skilled computer programmer who is comfortable with both front and back end programming. Full Stack Developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications and working alongside graphic designers for web design features, among other duties.\n\nFull Stack Developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.\n\nFull Stack Developer Responsibilities:\n- Developing front end website architecture.\n- Designing user interactions on web pages.\n- Developing back end website applications.\n- Creating servers and databases for functionality.\n- Ensuring cross-platform optimization for mobile phones.\n- Ensuring responsiveness of applications.\n- Working alongside graphic designers for web design features.\n- Seeing through a project from conception to finished product.\n- Designing and developing APIs.\n- Meeting both technical and consumer needs.\n- Staying abreast of developments in web applications and programming languages.\n\nFull Stack Developer Requirements:\n- Degree in Computer Science.\n- Strong organizational and project management skills.\n- Proficiency with fundamental front end languages such as HTML, CSS, and JavaScript.\n- Familiarity with JavaScript frameworks such as Angular JS, React, and Amber.\n- Proficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net.\n- Familiarity with database technology such as MySQL, Oracle, and MongoDB.\n- Excellent verbal communication skills.\n- Good problem-solving skills.\n- Attention to detail."
    },
    {
      "name": "PHP Developer",
      "value": "We are looking to hire a talented PHP Developer to manage our back-end services and ensure a seamless interchange of data between the server and our users. As a PHP Developer, you will be responsible for developing and coding all server-side logic. You will also be required to maintain the central database and respond to requests from front-end developers. To ensure success as a PHP Developer, you should have in-depth knowledge of object-oriented PHP programming, understanding of MVC designs, and working knowledge of front-end technologies including HTML5, JavaScript, and CSS3. Ultimately, a top-level PHP Developer can design and build efficient PHP modules while seamlessly integrating front-end technologies. PHP Developer Responsibilities: Conducting analysis of website and application requirements. Writing back-end code and building efficient PHP modules. Developing back-end portals with an optimized database. Troubleshooting application and code issues. Integrating data storage solutions. Responding to integration requests from front-end developers. Finalizing back-end features and testing web applications. Updating and altering application features to enhance performance. PHP Developer Requirements: Bachelor’s degree in Computer Science or similar field. Knowledge of PHP web frameworks including Yii, Laravel, and CodeIgniter. Knowledge of front-end technologies including CSS3, JavaScript, and HTML5. Understanding of object-oriented PHP programming. Previous experience creating scalable applications. Proficient with code versioning tools including Git, Mercurial, CVS, and SVN. Familiarity with SQL/NoSQL databases. Ability to project manage. Good problem-solving skills."
    },
    {
      "name": "JavaScript Developer",
      "value": "We are looking for a passionate JavaScript Developer to be responsible for all front-end platform related duties, from developing designs for complicated applications to analyzing code. The JavaScript Developer's responsibilities include optimizing applications, ensuring UI/UX feasibility, and implementing API designs and architecture. To be successful as a JavaScript Developer, you should have an understanding of web markup and expert knowledge of JavaScript. Ultimately, a quality JavaScript Developer should be able to work in a fast-paced environment and implement complex design specifications. JavaScript Developer Responsibilities: Building sustainable coding that may be used in the future. Ensuring feasibility of UI/UX designs. Enhancing performance of the main front-end website. Modifying designs and specifications of complex applications. Analyzing code, requirements, system risks, and software reliability. Collaborating with front-end and back-end web developers. JavaScript Developer Requirements: Degree in Computer Science, Engineering, MIS or related field. Extensive knowledge and understanding of JavaScript. Experience with JavaScript libraries (e.g. ExtJS, Backbone JS, and Angular JS). Proficiency in browser rendering behavior and performance. Experience in front-end tools (e.g. Grunt and Gulp JS.) Sound understanding of web markup, such as HTML5."
    },
    {
      "name": "React.js Developer",
      "value": "We are looking for a skilled React.js Developer to join our front-end development team. In this role, you will be responsible for developing and implementing user interface components using React.js concepts and workflows such as Redux, Flux, and Webpack. You will also be responsible for profiling and improving front-end performance and documenting our front-end codebase. To ensure success as a React.js Developer, you should have in-depth knowledge of JavaScript and React concepts, excellent front-end coding skills, and a good understanding of progressive web applications. Ultimately, a top-class React.js Developer should be able to design and build modern user interface components to enhance application performance. React.js Developer Responsibilities: Meeting with the development team to discuss user interface ideas and applications. Reviewing application requirements and interface designs. Identifying web-based user interactions. Developing and implementing highly-responsive user interface components using React concepts. Writing application interface codes using JavaScript following React.js workflows. Troubleshooting interface software and debugging application codes. Developing and implementing front-end architecture to support user interface concepts. Monitoring and improving front-end performance. Documenting application changes and developing updates. React.js Developer Requirements: Bachelor’s degree in Computer Science, Information Technology, or a similar field. Previous experience working as a React.js Developer. In-depth knowledge of JavaScript, CSS, HTML and front-end languages. Knowledge of REACT tools including React.js, Webpack, Enzyme, Redux, and Flux. Experience with user interface design. Knowledge of performance testing frameworks including Mocha and Jest. Experience with browser-based debugging and performance testing software. Excellent troubleshooting skills. Good project management skills."
    }
  ]
}
